{
    "SPK_GEN_FLU_001": "The student will understand and apply the 'Chunking' technique to break down sentences into manageable units, reducing pauses and improving fluency.",
    "SPK_GEN_PRO_001": "The student will be able to differentiate between and accurately pronounce a small set of common English vowel and consonant sounds that are frequently mispronounced by speakers of their native language (assuming a generic 'Beginner' student).",
    "SPK_GEN_PRO_002": "The student will be able to identify and apply correct word stress in two-syllable nouns and verbs, and understand how sentence stress highlights important information.",
    "SPK_GEN_LANG_001": "The student will be able to construct grammatically correct simple and compound sentences, understanding the role of conjunctions in connecting independent clauses.",
    "SPK_T1_STRAT_001": "The student will be able to consistently generate two clear, distinct, and relevant reasons to support their chosen preference in Speaking Task 1 within the 15-second preparation time.",
    "SPK_T1_CONT_001": "The student will be able to construct a simple sentence that clearly states their opinion or preference using a basic sentence template.",
    "SPK_T1_ORG_001": "The student will understand and be able to apply the basic three-part structure (Introduction, Body, Conclusion) to simple written or spoken responses.",
    "SPK_T2_STRAT_001": "The student can accurately identify the main proposed change and the two supporting reasons presented in a simple campus announcement.",
    "SPK_T2_CONT_001": "The student can identify the 'before' and 'after' states described in a reading passage and articulate the difference between them in a simple sentence.",
    "WRT_GEN_TYP_001": "The student can identify and correct their most common typing errors and implement strategies to improve typing speed and accuracy, ultimately enabling them to compose a full essay within the TOEFL time limit.",
    "WRT_GEN_STR_001": "The student will understand and be able to construct simple, compound, and complex sentences, recognizing their basic structures and using them to add variety to their writing.",
    "WRT_GEN_STY_001": "The student will be able to identify and replace informal language with formal alternatives in simple sentences.",
    "WRT_T1_STRAT_001": "The student will be able to identify the topic sentence (main argument) and supporting sentences (key supporting points) in a simple academic paragraph.",
    "WRT_T1_CONT_001": "The student can identify and clearly state the main topic and the central arguments of both the reading and the lecture in a concise introductory paragraph.",
    "LIS_GEN_CORE_001": "The student can identify the topic and speaker's purpose in a short, simple conversation.",
    "LIS_NOTE_STRAT_001": "The student will understand and be able to apply a basic, consistent system for taking notes using abbreviations and symbols to capture key information efficiently.",
    "RD_GEN_STRAT_001": "The student can identify the main topic and overall structure of a short passage by focusing on the first and last sentences of each paragraph and the title.",
    "RD_QT_FACT_001": "The student will be able to accurately identify and extract explicitly stated information from a short text to answer direct factual questions.",
    "GRM_SS_CORE_001": "The student will be able to identify and correctly use subjects, verbs, and objects to construct simple, grammatically correct sentences.",
    "GRM_VT_TENSE_001": "The student will be able to identify and correctly use the simple, progressive, and perfect tenses (present, past, future) in basic sentences to clearly express when an action happens.",
    "VOC_ACAD_AWL_001": "The student will be able to identify and understand the basic meaning of 5-10 high-frequency words from the Academic Word List (AWL) in simple sentences and short paragraphs.",
    "VOC_STRAT_CONT_001": "The student will be able to identify and use different types of context clues (definition, example, synonym, antonym) to understand the meaning of unfamiliar words in simple sentences.",
    "TTS_ALL_TIME_001": "The student will understand the importance of time management on the TOEFL and be able to create a basic time allocation plan for each section.",
    "Speaking Fluently for TOEFL Speaking Question 1 (Independent Task - e.g., giving an opinion)": "Sentence Starter and Structure Template",
    "Structuring a Response for TOEFL Speaking Question 1 (e.g., Opinion + Reason 1 + Example 1 + Reason 2 + Example 2)": "Detailed Paragraph Template with Guiding Questions",
    "Writing a Clear Thesis Statement for TOEFL Independent Essay": "Thesis Statement Template with Guiding Questions",
    "Developing a Body Paragraph (Point-Evidence-Explanation) for TOEFL Independent Essay": "Detailed Paragraph Template with Guiding Questions",
    "Paraphrasing a key point from the Reading Passage for TOEFL Integrated Writing": "Synonym Replacement and Sentence Frame Scaffold",
    "Synthesizing a point from the Listening Passage with a point from the Reading Passage for TOEFL Integrated Writing": "Detailed Paragraph Template",
    "Correctly using Subject-Verb Agreement in sentences": "Controlled Sentence Completion Drill",
    "Correctly using Simple Past Tense to describe past events": "Sentence Completion Template",
    "Using appropriate Academic Vocabulary instead of informal words": "Academic Vocabulary List with Sentence Frames",
    "Crafting a clear and arguable thesis statement.": "Introduction - Thesis Statement",
    "Using varied and precise academic vocabulary.": "Introduction - Thesis Statement",
    "Ensuring subject-verb agreement.": "Introduction - Thesis Statement",
    "Creating smooth transitions between sentences.": "Introduction - Thesis Statement",
    "General writing assistance": "Introduction - Thesis Statement",
    "Independent Essay": "Introduction - Thesis Statement",
    "Independent Essay - Body Paragraph 1 - Topic Sentence": "Body Paragraph 1 - Topic Sentence",
    "Independent Essay Writing - Body Paragraph Structure": "Body Paragraph 1 - Topic Sentence",
    "Body Paragraph 1 - Topic Sentence": "Independent Essay",
    "Summarizing Reading Point 1": "Integrated Essay",
    "Connecting Listening to Reading Point 1": "Integrated Essay",
    "Independent Essay Writing - Body Paragraph Development": "Body Paragraph 1 - Evidence",
    "Task Fulfillment, Argumentation, Vocabulary, Time Management": "Body Paragraph 1 - Evidence",
    "Fluency": "The student is at a Beginner level and struggling with fluency, likely due to a limited vocabulary and difficulty constructing sentences spontaneously. The student also exhibits frustration, which may be hindering their progress.",
    "Pronunciation (specific phonemes)": "The student is making errors in pronunciation of specific phonemes and is exhibiting signs of frustration, likely due to the difficulty of the task and the beginner level of language proficiency.",
    "Grammar (tense, S-V agreement, articles)": "The student is making grammatical errors (tense, subject-verb agreement, articles) and shows signs of frustration, likely stemming from these errors and the difficulty of communicating effectively at a beginner level.",
    "Vocabulary (range, academic)": "The student is struggling with vocabulary range and using academic vocabulary appropriate for the task. This is compounded by their beginner language level and resulting frustration.",
    "Coherence": "The student is struggling with coherence in their spoken responses, likely due to their beginner language level. This is compounded by frustration, which hinders learning.",
    "Cohesion": "The student is struggling with cohesion in their spoken English, specifically with using appropriate transition words and phrases to connect their ideas. This is compounded by evident frustration, likely stemming from the difficulty in expressing themselves clearly.",
    "Task Fulfillment": "The student is struggling with Task Fulfillment at a Beginner level, likely due to a lack of structured approach and basic language skills. Frustration is compounding the issue.",
    "Essay Structure (thesis, topic sentences)": "The student is struggling with basic essay structure, specifically the thesis statement and topic sentences. This indicates a lack of understanding of how to organize ideas logically and present a clear argument. The student's frustration suggests they may be overwhelmed by the task.",
    "Paraphrasing": "The student is struggling with paraphrasing, a crucial skill for demonstrating comprehension and avoiding plagiarism. At a beginner level, this likely stems from a limited vocabulary and difficulty restructuring sentences. The student also exhibits frustration, which can hinder learning.",
    "Summarizing": "The student is struggling with summarizing, likely due to a lack of understanding of how to identify and extract key information. The student's beginner language proficiency exacerbates this issue, making it difficult to rephrase information concisely. Frustration is also a factor, hindering learning.",
    "Synthesizing": "The student is struggling with synthesizing information at a beginner level, likely due to a lack of structured approach and limited vocabulary. The frustration indicates a need for simplified, manageable steps and positive reinforcement."
}